{
    "contestId": 2163,
    "index": "E",
    "title": "E. Plegma",
    "statement": "This is a run-twice (communication) problem.\nThere are two players: Player A and Player B. The jury will first interact with player A. After player A ends their interaction, the jury will interact with player B. Note that player A and player B may not directly pass information to each other; both players are only able to send information or receive information from the jury, but they may agree on the strategy they will use to communicate.\nThe jury has a\nbinary grid\n$$$G$$$ of $$$n$$$ rows and $$$n$$$ columns (each cell of this grid has value either $$$0$$$ or $$$1$$$). Row $$$1$$$ is the top-most row, and column $$$1$$$ is the left-most column. The\nconnectivity\nof this grid is defined as $$$1$$$ if there is a path going left, right, up, or down going through only cells with value $$$1$$$ connecting each pair of cells $$$(i_1,j_1)$$$ and $$$(i_2,j_2)$$$ with $$$G_{i_1,j_1}=G_{i_2,j_2}=1$$$. Note that moving diagonally is not allowed. It is guaranteed that there exists at least one cell with value of $$$1$$$ in this grid.\nThe jury first interacts with player A. The jury will give player A the grid $$$G$$$. After inspecting the grid, player A must determine\ntwo integers\n$$$r$$$ and $$$c$$$ and send them to the jury. At the start of player B's interaction, player B will receive\nthe values of all cells in the $$$r$$$'th row and all cells in the $$$c$$$'th column\nfrom the jury. Note that player B is not given the values of $$$r$$$ and $$$c$$$.\nPlayer A wants to ensure player B can determine the connectivity of $$$G$$$. Your task is to act as both players and find a strategy so that player B is able to determine the connectivity correctly. Note that the communicator of this task is not adaptive – that is, the grid given to you on the first run will be the same as the grid used to evaluate the connectivity.",
    "inputSpecification": "Input\nYour code will be ran exactly two times on each test. On the first run, you will be Player A, and on the second Player B.\nFirst Run Input\nThe first line of the input contains the string\nfirst\n. The purpose of this is so your program recognizes that this is its first run, and it should act as Player A.\nEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows.\nThe first line of each test case contains two integers $$$n$$$ and $$$C$$$ ($$$2 \\leq n \\leq 1000, 0 \\leq C \\leq 1$$$) – the size of the grid and the connectivity respectively.\nThe following $$$n$$$ lines contain information about the grid. The $$$i$$$th of these lines contains a binary string $$$G_i$$$ of length $$$n$$$, indicating the $$$i$$$-th row of the grid.\nIt is guaranteed that:\nThe sum of $$$n^2$$$ does not exceed $$$2\\cdot 10^6$$$ over all test cases\nThe value of $$$C$$$ matches with the information in the grid – that is, if $$$C=1$$$, then the grid has connectivity $$$1$$$, and if $$$C=0$$$, then the grid has connectivity $$$0$$$.\nEach grid has at least one $$$1$$$ in the input.\nSecond Run Input\nThe first line of the input contains the string\nsecond\n. The purpose of this is so your program recognizes that this is its second run, and it should act as Player B.\nEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows.  Note that this number is equal to $$$t$$$ from the first run input.\nThe first line of each test case contains exactly one integer $$$n$$$ — the size of the grid given on the $$$i$$$'th test case of the first run input.\nThe second line of each test case contains a binary string $$$G_{r, 1}G_{r, 2}\\ldots G_{r, n}$$$ — the contents in row $$$r$$$ of the grid. Note that the integer $$$r$$$ is sent by player A to the jury at the end of their interaction of the $$$i$$$'th test case\nThe third line of each test case contains a binary string $$$G_{1, c}G_{2, c}\\ldots G_{n, c}$$$ — the contents in column $$$c$$$ of the grid. Note that the integer $$$c$$$ is sent by player A to the jury at the end of their interaction of the $$$i$$$'th test case.\nHacks\nTo make hacks, use the following format:\nThe first line should contain exactly one integer $$$t$$$ $$$(1 \\le t \\le 10^4)$$$ — the number of grids. Then, $$$t$$$ blocks of input should follow.\nThe first line of each block of input must contain a single integer $$$n$$$ $$$(2 \\le n \\le 1000)$$$ — the size of the grid the jury will choose.\nEach of the next $$$n$$$ lines should contain a binary string of size $$$n$$$. The $$$i$$$'th of these lines should contain $$$G_{i, 1}G_{i, 2}\\ldots G_{i, n}$$$ — the contents of the $$$i$$$'th row of the grid the jury will choose.\nThere must exist at least a single cell with value of $$$1$$$ in each grid, and the sum of $$$n^2$$$ over all test cases should not exceed $$$2\\cdot 10^6$$$.\nNote that the connectivity of each grid is determined by the jury, and you do not need to output it for a hack.",
    "outputSpecification": "Output\nFor the first run, for each test case, output two integers $$$r$$$ and $$$c$$$ ($$$1 \\leq r,c \\leq n$$$). This indicates that you want the second run to receive the $$$r$$$-th row and the $$$c$$$-th column of the grid.\nFor the second run, for each test case, output an integer $$$C$$$ ($$$0 \\leq C \\leq 1$$$) – the connectivity of the grid.",
    "note": "Note\nOn the first input example, the first grid is the following:\n1\n1\n1\n0\nOn the first run, we know that $$$n = 2$$$. After inspecting the example, we can determine that the connectivity is $$$1$$$.\nFor the sake of this example, suppose Player A and Player B have agreed to some strategy where if the connectivity is $$$1$$$, then player A should send a row and a column that both end with $$$0$$$. In this case, row $$$2$$$ and column $$$2$$$ satisfies this strategy.\nNote that this is an example strategy for the sake of demonstration, and using this strategy will not work for all cases.\nThen, take a look at the second run. Now, we are Player B. We receive that $$$n = 2$$$ and that the chosen row has values $$$r = [1, 0]$$$ and the chosen column has values $$$c = [1, 0]$$$. Since the last number of each row is $$$0$$$, player B uses the agreed upon strategy to determine that the connectivity is $$$1$$$.",
    "tags": [
        "bitmasks",
        "combinatorics",
        "communication",
        "interactive"
    ],
    "rating": 2700
}