{
    "contestId": 2171,
    "index": "C1",
    "title": "C1. Renako Amaori and XOR Game (easy version)",
    "statement": "Yup. I couldn't do this any longer. No. Freaking. Way.\n— Renako Amaori\nThis is the easy version of the problem. The only difference between the easy and hard versions is that in the easy version, $$$a_i, b_i \\leq 1$$$.\nRenako is stuck between a rock and a hard place... and by that, of course, I mean Ajisai and Mai! Both of them want to hang out with her, and she just can't decide! So Ajisai and Mai have decided to play the XOR game.\nAjisai and Mai are given arrays $$$a$$$ and $$$b$$$ of length $$$n$$$ ($$$0\\leq a_i, b_i\\leq {\\color{red}{1}}$$$). They will play a game that lasts for $$$n$$$ turns, where Ajisai moves on odd-numbered turns and Mai moves on even-numbered turns. On the $$$i$$$-th turn, the player to move may choose to swap $$$a_i$$$ and $$$b_i$$$, or pass.\nNote that if a swap occurs,\nthe index that is being swapped must match the turn number\n. For example, on the first turn, Ajisai may choose to swap $$$a_1$$$ and $$$b_1$$$, or pass. On the second turn, Mai may choose to swap $$$a_2$$$ and $$$b_2$$$, or pass. This continues for $$$n$$$ turns. Thus, only Ajisai can swap odd indices, and only Mai can swap even indices.\nAt the end of the game, Ajisai achieves a score of $$$a_1 \\oplus a_2 \\oplus \\dots \\oplus a_n$$$, and Mai achieves a score of $$$b_1 \\oplus b_2 \\oplus \\dots \\oplus b_n$$$$$$^{\\text{∗}}$$$. The player with the higher score wins. If the players have the same score, the game ends in a tie.\nDetermine the outcome of the game with optimal play. More formally, one player is considered to win with optimal play if there exists a strategy for them such that they always win, regardless of their opponent's choices. The game is considered a tie with optimal play if neither player has such a strategy.\n$$$^{\\text{∗}}$$$$$$\\oplus$$$ denotes the\nbitwise XOR operation",
    "inputSpecification": "Input\nThe first line contains a single integer $$$t$$$ ($$$1\\leq t\\leq 10^4$$$)  — the number of test cases.\nThe first line of each test case contains a single integer $$$n$$$ ($$$1\\leq n\\leq 2\\cdot 10^5$$$).\nThe second line of each test case contains $$$n$$$ integers, $$$a_1, a_2, \\dots, a_n$$$ ($$$0\\leq a_i\\leq 1$$$).\nThe third line of each test case contains $$$n$$$ integers, $$$b_1, b_2, \\dots, b_n$$$ ($$$0\\leq b_i\\leq 1$$$).\nIt is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2\\cdot 10^5$$$.",
    "outputSpecification": "Output\nFor each test case, output on a single line \"\nAjisai\n\" if Ajisai wins with optimal play, \"\nMai\n\" if Mai wins with optimal play, or \"\nTie\n\" if the game ends in a tie with optimal play.\nYou may output the answer in any case (upper or lower). For example, the strings \"\nmAi\n\", \"\nmai\n\", \"\nMAI\n\", and \"\nmaI\n\" will be recognized as \"\nMai\n\".",
    "note": "Note\nIn the first example, one way the game might play out is as follows:\nOn turn 1, Ajisai chooses to swap $$$a_1$$$ and $$$b_1$$$. Now the arrays are $$$a = [1, 0, 0, 1]$$$ and $$$b = [1, 0, 1, 1]$$$.\nOn turn 2, Mai chooses to pass.\nOn turn 3, Ajisai chooses to swap $$$a_3$$$ and $$$b_3$$$. Now the arrays are $$$a = [1, 0, 1, 1]$$$ and $$$b = [1, 0, 0, 1]$$$.\nOn turn 4, Mai chooses to swap $$$a_4$$$ and $$$b_4$$$. Now the arrays are $$$a = [1, 0, 1, 1]$$$ and $$$b = [1, 0, 0, 1]$$$.\nNow, Ajisai's final score is $$$1\\oplus 0\\oplus 1\\oplus 1 = 1$$$ and Mai's final score is $$$1\\oplus 0\\oplus 0\\oplus 1 = 0$$$. Therefore, Ajisai wins the game.\nIt is not guaranteed that the above description is representative of optimal play.",
    "tags": [
        "bitmasks",
        "games",
        "greedy"
    ],
    "rating": 1100
}