{
    "contestId": 2172,
    "index": "E",
    "title": "E. Number Maze",
    "statement": "At the \"Number Maze,\" a mysterious code master stands guard. He blocks the path and smiles, saying: \"Brave adventurer, passing through this gate will not be easy! An ancient numeric code, capable of being rearranged into numerous combinations, is in the code master's possession. The traveler must choose two numeric codes from these combinations and show their\n$$$x$$$A$$$y$$$B\nresult, or the gate will trap the traveler here forever!\"\nThe rules of\n$$$x$$$A$$$y$$$B\nare as follows:\nEach\nA\nindicates that a digit in both codes matches in both value and position.\nEach\nB\nindicates that a digit in both codes matches in value but not position.\nFor example:\nCodes Compared\nResult\nExplanation\n5234 vs. 5789\n1A0B\nOnly the digit $$$5$$$ matches in both value and position.\n5634 vs. 6589\n0A2B\nDigits $$$5$$$ and $$$6$$$ match only in value but are in different positions.\n1847 vs. 6149\n1A1B\nThe digit $$$4$$$ matches in both value and position, while the digit $$$1$$$ only matches in value.\nYou are given a base numeric code $$$n$$$, which can be one of $$$\\{12, 123, 1234\\}$$$. Consider all possible permutations of the digits of $$$n$$$, sorted in ascending order. Let the $$$j$$$-th and $$$k$$$-th permutations (1-indexed) be the two numeric codes chosen by the traveler.\nYour task is to compare these two permutations and determine their\n$$$x$$$A$$$y$$$B\nresult, according to the rules above.",
    "inputSpecification": "Input\nEach test contains multiple test cases. The first line contains a single integer $$$t$$$, representing the number of tests the code master will conduct. The description of the test cases follows.\nThe only line of each test case contains three integers $$$n$$$, $$$j$$$, and $$$k$$$, representing the base numeric code and the indices of the two permutations to be compared, respectively.\n$$$1\\le t \\le 1000$$$\n$$$n \\in \\{12,123,1234\\}$$$\nBoth $$$j$$$ and $$$k$$$ are valid indices of permutations of the digits of $$$n$$$.",
    "outputSpecification": "Output\nFor each test case, output the result in the format\n$$$x$$$A$$$y$$$B\n, where $$$x$$$ and $$$y$$$ are integers.",
    "note": "",
    "tags": [
        "implementation"
    ],
    "rating": 1200
}