{
    "contestId": 2169,
    "index": "B",
    "title": "B. Drifting Away",
    "statement": "There's a river flowing in front of Monocarp's house, which can be represented as a strip of cells. In some cells, there is a strong current, while in others, there is no current. It can be represented as a string $$$s$$$, consisting of the following characters:\nthe \"less-than\" sign ('\n<\n') — leftward current;\nthe \"greater-than\" sign ('\n>\n') — rightward current;\nan asterisk ('\n*\n') — no current.\nAt first, Monocarp chooses the cell to start his journey along the river at.\nIf there is a current in the cell, where Monocarp is at the moment, he is carried to the neighboring cell in the direction of the current. If there is no neighboring cell (i. e., a leftward current in cell $$$1$$$ or a rightward current in cell $$$n$$$), Monocarp ends up on the shore. Each move takes one minute.\nIf there is no current in the cell, where Monocarp is at the moment, he rows to the neighboring cell on the left or to the neighboring cell on the right. If there is no neighboring cell in the direction where Monocarp decides to row to, he ends up on the shore. Each move also takes one minute.\nMonocarp wants to sail along the river for as long as possible. If Monocarp can sail infinitely, print $$$-1$$$. Otherwise, print the maximum time Monocarp can sail along the river before ending up on the shore.",
    "inputSpecification": "Input\nThe first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases.\nThe only line of each test case contains a string $$$s$$$ ($$$1 \\le |s| \\le 3 \\cdot 10^5$$$), consisting only of characters '\n<\n' (leftward current), '\n>\n' (rightward current), '\n*\n' (no current). The ASCII codes are $$$60$$$, $$$62$$$, and $$$42$$$, respectively.\nAn additional constraint on the input: the total length of strings $$$s$$$ over all test cases does not exceed $$$3 \\cdot 10^5$$$.",
    "outputSpecification": "Output\nFor each test case, output a single integer:\n$$$-1$$$, if Monocarp can sail along the river infinitely;\nthe maximum time Monocarp can sail along the river before ending up on the shore, otherwise.",
    "note": "",
    "tags": [
        "greedy",
        "implementation"
    ],
    "rating": 1100
}