{
    "contestId": 2173,
    "index": "A",
    "title": "A. Sleeping Through Classes",
    "statement": "You have $$$n$$$ classes today, which are numbered from $$$1$$$ to $$$n$$$.\nThe classes are described by a binary string$$$^{\\text{∗}}$$$ $$$s$$$ of length $$$n$$$. We call class $$$i$$$\nimportant\nif and only if\n$$$s_i = \\mathtt 1 $$$. For each\nimportant\nclass, you\nmust\nstay awake and listen to it.\nYou are very tired and wish to sleep through as many classes as possible. However, falling asleep takes time. If you listen to an\nimportant\nclass $$$i$$$, then you cannot fall asleep for the next $$$k$$$ classes, i.e., you must also stay awake in classes $$$i+1, i+2, \\ldots, i+k$$$ (or until the end of the day, if fewer than $$$k$$$ classes remain).\nFor classes that are not\nimportant\n, you may sleep through them unless the rule above forces you to stay awake.\nYour task is to find out the maximum number of classes you can sleep through today.\n$$$^{\\text{∗}}$$$A binary string is a string where each character is either $$$\\mathtt{0}$$$ or $$$\\mathtt{1}$$$.",
    "inputSpecification": "Input\nEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 500$$$). The description of the test cases follows.\nThe first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\le n, k \\le 100$$$).\nThe second line of each test case contains the string $$$s$$$ of length $$$n$$$ ($$$s_i = \\mathtt 0$$$ or $$$\\mathtt 1$$$).",
    "outputSpecification": "Output\nFor each test case, output a single integer — the maximum number of classes you can sleep through today.",
    "note": "Note\nIn the first test case, you must listen to class $$$1$$$ and class $$$4$$$. After listening to class $$$1$$$, you cannot fall asleep in class $$$2$$$. So the only class you can sleep through is class $$$3$$$.\nIn the second test case, you can sleep through all the classes.\nIn the fourth test case, you can only sleep through classes $$$1$$$ and $$$5$$$.",
    "tags": [
        "greedy",
        "implementation"
    ],
    "rating": 800
}