{
    "contestId": 2181,
    "index": "I",
    "title": "I. Irrigation Interlock",
    "statement": "Two irrigation cooperatives share the same fertile valley. The first cooperative maintains pumps scattered across the fields; the second supervises reservoirs on the surrounding hills. Whenever both cooperatives decide to lay a pair of new pipes, the pipes must intersect — at such an intersection they can install a joint valve. Pipes always follow a straight line segment between a pair of distinct pumps or a pair of distinct reservoirs. Two pipes intersect if they share at least one common point (touching and overlapping pipes are considered intersecting).\nYou are given the exact coordinates of every pump and every reservoir on a Cartesian plane. For each planning scenario, determine whether the first cooperative can pick two distinct pumps and the second cooperative can pick two distinct reservoirs so that the two straight pipes intersect. If this is possible, report the indices of those pumps and reservoirs; otherwise declare that the project cannot be realized.",
    "inputSpecification": "Input\nThe first line contains an integer $$$t$$$ ($$$1 \\le t \\le 10^5$$$) — the number of planning scenarios.\nFor each planning scenario:\nThe first line contains an integer $$$n$$$ ($$$2 \\le n \\le 10^5$$$) — the number of pumps managed by the first cooperative.\nEach of the next $$$n$$$ lines contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$|x_i|, |y_i| \\le 10^9$$$) — the Cartesian coordinates of pump $$$i$$$. The pump locations are distinct.\nThe next line contains an integer $$$m$$$ ($$$2 \\le m \\le 10^5$$$) — the number of reservoirs managed by the second cooperative.\nEach of the next $$$m$$$ lines contains two integers $$$u_j$$$ and $$$v_j$$$ ($$$|u_j|, |v_j| \\le 10^9$$$) — the Cartesian coordinates of reservoir $$$j$$$. The reservoir locations are distinct.\nNo pump shares its location with any reservoir.\nIt is guaranteed that the sum of $$$n$$$ over all planning scenarios does not exceed $$$2 \\cdot 10^5$$$ and the sum of $$$m$$$ over all planning scenarios does not exceed $$$2 \\cdot 10^5$$$.",
    "outputSpecification": "Output\nFor each planning scenario:\nIf the first cooperative can choose two pumps and the second cooperative can choose two reservoirs so that the straight pipes connecting each pair intersect, output four integers $$$p_1$$$, $$$p_2$$$, $$$r_1$$$, $$$r_2$$$ — the indices of two chosen pumps ($$$1 \\le p_1, p_2 \\le n$$$; $$$p_1 \\ne p_2$$$) and two chosen reservoirs ($$$1 \\le r_1, r_2 \\le m$$$; $$$r_1 \\ne r_2$$$).\nIf such an intersection is impossible, output $$$-1$$$.\nIn case several valid solutions exist, any one of them is acceptable.",
    "note": "Note\nPlanning scenario 1\nPlanning scenario 2\nPlanning scenario 3",
    "tags": [
        "geometry"
    ],
    "rating": 3500
}