{
    "contestId": 2172,
    "index": "N",
    "title": "N. New Kingdom",
    "statement": "In the upcoming strategy game\nIsland Cartographer: Penultimate Chapter\n(ICPC), players take the role of bridge engineers employed by the\nImperial Cartography & Planning Council\nto design a new kingdom spread across an archipelago of $$$n$$$ islands connected by a network of causeways. To achieve balance between stability and exploration, the council requires that the player's plan satisfy several strict rules.\nThe first and fundamental requirement is that the kingdom must be\nsimple\nand\nconnected\n. That is, each causeway connects two different islands, no two causeways connect the same pair of islands, and for each pair of different islands, there exists a route between them using a sequence of causeways.\nAfter learning the ancient wisdom of the legendary tourist Euler, some visitors might be able to traverse every causeway exactly once in a single, seamless tour. If this is possible, then those visitors would not have enough time to enjoy their trips. To make them travel for longer, the council's second requirement is that\nexactly $$$k$$$\nislands have an odd number of causeways connected to them.\nSome causeways are considered\nvital\nto the kingdom. A causeway is vital if removing it would make travel between some pair of islands impossible. These causeways are important for local development, cultural identity, and tourism, but having too many of them could lead to traffic congestion. Therefore, the council's third and final requirement is that the kingdom must contain\nexactly $$$b$$$\nvital causeways.\nTo complete a game of ICPC, the player must submit a plan to build causeways that satisfies all the requirements for the parameters $$$n$$$, $$$k$$$, and $$$b$$$ provided by the council. Before the game's release, you are tasked with testing the game by designing a valid kingdom plan as the player. In case the game is impossible to complete, please report so.",
    "inputSpecification": "Input\nEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$. The description of the test cases follows.\nThe only line of each test case contains three integers $$$n$$$, $$$k$$$, and $$$b$$$, representing the number of islands, the exact number of islands connected to an odd number of causeways, and the exact number of vital causeways, respectively.\n$$$1\\le n\\le 10^5$$$\n$$$0\\le k \\le n$$$\n$$$0\\le b \\le n-1$$$\nThe sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.",
    "outputSpecification": "Output\nFor each test case, if there are no solutions that fit the requirements for a valid plan, output \"\nNo\n\" in a single line.\nOtherwise, output \"\nYes\n\" in the first line. Then, output a single integer $$$m$$$ in the second line, indicating the number of causeways in your plan. In each of the next $$$m$$$ lines, output two integers $$$u_i$$$ and $$$v_i$$$ separated by a whitespace, meaning that the islands $$$u_i$$$ and $$$v_i$$$ are connected with a single causeway. If there are multiple valid plans, output any.\nYour output must satisfy:\n$$$0\\le m\\le 5n$$$\nFor all $$$1\\le i\\le m$$$, $$$1\\le u_i, v_i\\le n$$$.\nFor all $$$1\\le i\\le m$$$, $$$u_i\\neq v_i$$$.\nFor all $$$i\\neq j$$$, $$$\\{u_i, v_i\\}\\neq \\{u_j, v_j\\}$$$.\nIt can be proven that for every possible input that has a solution, there exists a solution that satisfies these constraints.",
    "note": "",
    "tags": [
        "constructive algorithms",
        "graphs",
        "implementation"
    ],
    "rating": 2800
}